In [19]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.212175  0.137092  1.349091  1.189919
2013-01-02  3.019510 -0.250248 -0.688139 -0.788652
2013-01-03 -0.142657  0.444514  0.343141  0.045932
2013-01-04 -1.334817  0.022978  1.648044 -0.829521
2013-01-05  0.289574 -0.484918 -0.523776  0.954244
2013-01-06  1.755251  1.420915 -1.252280  0.521949

In [9]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.212175    3.019510   -0.142657   -1.334817    0.289574    1.755251
B    0.137092   -0.250248    0.444514    0.022978   -0.484918    1.420915
C    1.349091   -0.688139    0.343141    1.648044   -0.523776   -1.252280
D    1.189919   -0.788652    0.045932   -0.829521    0.954244    0.521949

In [3]:
df2 = pd.DataFrame(
        {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
        }
    )
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [5]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [6]:
df.index, df.columns

(DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
                '2013-01-05', '2013-01-06'],
               dtype='datetime64[ns]', freq='D'),
 Index(['A', 'B', 'C', 'D'], dtype='object'))

In [7]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.633173  0.215055  0.146014  0.182312
std    1.531265  0.671743  1.169787  0.861590
min   -1.334817 -0.484918 -1.252280 -0.829521
25%   -0.053949 -0.181942 -0.647048 -0.580006
50%    0.250875  0.080035 -0.090317  0.283940
75%    1.388832  0.367659  1.097604  0.846170
max    3.019510  1.420915  1.648044  1.189919

In [10]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.189919  1.349091  0.137092  0.212175
2013-01-02 -0.788652 -0.688139 -0.250248  3.019510
2013-01-03  0.045932  0.343141  0.444514 -0.142657
2013-01-04 -0.829521  1.648044  0.022978 -1.334817
2013-01-05  0.954244 -0.523776 -0.484918  0.289574
2013-01-06  0.521949 -1.252280  1.420915  1.755251

In [11]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.289574 -0.484918 -0.523776  0.954244
2013-01-02  3.019510 -0.250248 -0.688139 -0.788652
2013-01-04 -1.334817  0.022978  1.648044 -0.829521
2013-01-01  0.212175  0.137092  1.349091  1.189919
2013-01-03 -0.142657  0.444514  0.343141  0.045932
2013-01-06  1.755251  1.420915 -1.252280  0.521949

In [12]:
df.loc[dates[0]]

A    0.212175
B    0.137092
C    1.349091
D    1.189919
Name: 2013-01-01 00:00:00, dtype: float64

In [13]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.212175  0.137092
2013-01-02  3.019510 -0.250248
2013-01-03 -0.142657  0.444514
2013-01-04 -1.334817  0.022978
2013-01-05  0.289574 -0.484918
2013-01-06  1.755251  1.420915

In [14]:
df.loc["20130102", ["A", "B"]]

A    3.019510
B   -0.250248
Name: 2013-01-02 00:00:00, dtype: float64

In [15]:
df.iloc[3]

A   -1.334817
B    0.022978
C    1.648044
D   -0.829521
Name: 2013-01-04 00:00:00, dtype: float64

In [16]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.334817  0.022978
2013-01-05  0.289574 -0.484918

In [17]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.212175  0.137092  1.349091  1.189919
2013-01-02  3.019510 -0.250248 -0.688139 -0.788652
2013-01-05  0.289574 -0.484918 -0.523776  0.954244
2013-01-06  1.755251  1.420915 -1.252280  0.521949

In [18]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.212175  0.137092  1.349091  1.189919
2013-01-02  3.019510       NaN       NaN       NaN
2013-01-03       NaN  0.444514  0.343141  0.045932
2013-01-04       NaN  0.022978  1.648044       NaN
2013-01-05  0.289574       NaN       NaN  0.954244
2013-01-06  1.755251  1.420915       NaN  0.521949

## datetime in pandas

In [20]:
import datetime

In [42]:
pd.date_range("2022-01-01", periods=3, freq="H")

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 01:00:00',
               '2022-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')

In [41]:
pd.date_range("2022-01-01", periods=3, freq="D")

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03'], dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range("2022-01-01", periods=3, freq="M")

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31'], dtype='datetime64[ns]', freq='M')

In [29]:
pd.date_range("2022-01-01", periods=3, freq="Y")

DatetimeIndex(['2022-12-31', '2023-12-31', '2024-12-31'], dtype='datetime64[ns]', freq='A-DEC')

In [33]:
friday = pd.Timestamp("2022-01-21")
friday.day_name()

'Friday'

In [36]:
friday.day_of_year

21

In [43]:
# add 1 day
saturday = friday + pd.Timedelta("1 day")
saturday.day_name()

'Saturday'

In [44]:
# Add 1 business day (Friday --> Monday)
monday = friday + pd.offsets.BDay()
monday.day_name()

'Monday'

In [61]:
import collections
s = 'beabeefeab'

char_count = collections.Counter(s)
n = len(char_count)

i = 0
while i < n-2:
    print(char_count[i])
    i+=1

0
0

In [80]:
sets = set(s)
sets

{'a', 'b', 'e', 'f'}

In [70]:
import itertools as it

In [85]:
m = 0
for ch1, ch2 in it.combinations(set(s), 2):
    f = [c for c in s if (c == ch1 or c == ch2)]

    if all([a != b for a, b in zip(f, f[1:])]):
        m = max(m, len(f))

print(m)

5